// pages/my/sellingareas/sellingareas.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    active2: 0,
    active3: [],
    list: [{
      "city": "石家庄",
      "areas": [{
        "name": "光华路营业厅",
        "location": "翟营大街与光华路交叉口东行150米路北",
        "phone": "87758300"
      }, {
        "name": "方北营业厅",
        "location": "体育大街与方北路交叉口东行500米路南",
        "phone": "86052822"
      }, {
        "name": "新华营业厅",
        "location": "兴凯路与青年街交叉口南行50米路东（二中南门对面）",
        "phone": "87897309"
      }, {
        "name": "时光营业厅",
        "location": "工农路时光街口东行50米路南",
        "phone": "83033207"
      }]
    }, {
      "city": "廊坊",
      "areas": [{
        "name": "尚都金茂营业厅",
        "location": "新华路与爱民道交口东北角尚都金茂大厦底商门脸42-甲",
        "phone": "暂无"
      }, {
        "name": "四大街行政审批中心厅",
        "location": "第四大街行政审批中心-行政收费大厅",
        "phone": "暂无"
      }, {
        "name": "光明西道营业厅",
        "location": "光明西道臻丽家园门脸西数3号",
        "phone": "暂无"
      }, {
        "name": "九区营业厅",
        "location": "管道局九区（康乐花园）物业楼一楼（西门进）",
        "phone": "暂无"
      }, {
        "name": "光明东道营业厅	",
        "location": "廊坊市广阳区光明东道56号紫云轩小区底商",
        "phone": "暂无"
      }, {
        "name": "开发区营业厅",
        "location": "金源道51号国际广场F座（高尔夫花园小区艾力枫社警务站一楼大厅）",
        "phone": "暂无"
      }, {
        "name": "九州营业厅",
        "location": "廊坊市广阳区九州镇九州四村派出所对面",
        "phone": "暂无"
      }, {
        "name": "万庄营业厅		",
        "location": "万庄石油矿区综合收费大厅",
        "phone": "暂无"
      }, {
        "name": "天津营业厅",
        "location": "天津市武清区大王古庄镇京滨工业园京滨睿城4 - 1",
        "phone": "暂无"
      }, {
        "name": "万庄综合营业厅	",
        "location": "万庄镇南街恒远四街14号",
        "phone": "暂无"
      }, {
        "name": "潘庄营业厅	",
        "location": "广阳区北旺乡潘庄村4号",
        "phone": "暂无"

      }]
    }, {
      "city": "开封",
      "areas": [{
        "name": "东司门营业厅",
        "location": "汴京饭店十字路口，东大街与解放路交叉路口向南（北土街三十九号东司门中医院分院斜对面）",
        "phone": "暂无"
      }, {
        "name": "西区营业厅	",
        "location": "黄河大街中段，康太家园大门北50米路西（黄河大街与宋城路交叉口往北300米）",
        "phone": "暂无"
      }, {
        "name": "开封市民之家	",
        "location": "郑开大道与三大结交叉口路北开封市民之家三楼69号窗口",
        "phone": "暂无"
      }]
    }, {
      "city": "新乡",
      "areas": [{
        "name": "人民路营业厅",
        "location": "人民东路296号，新飞大道与人民东路交叉口往东300米路北，红旗公安分局斜对面",
        "phone": "暂无"
      }, {
        "name": "解放路营业厅	",
        "location": "	解放路307号，中心医院（老三院）体检大楼对面",
        "phone": "暂无"
      }, {
        "name": "北站营业厅		",
        "location": "宝山路与团结路交叉口西北角",
        "phone": "暂无"
      }, {
        "name": "辉县营业厅",
        "location": "东2环东夏峰村加气站院内",
        "phone": "暂无"
      }]
    }, {
      "city": "温州",
      "areas": [{
        "name": "温州新奥燃气第一营业厅	",
        "location": "温州市龙湾区永强大道4567号3号楼一楼南厅（滨海大酒店副楼）",
        "phone": "暂无"
      }, {
        "name": "区府服务中心	",
        "location": "龙湾区高新区新政服务中心西裙楼一楼（温州市公共资源交易中心龙湾分中心内）",
        "phone": "暂无"
      }]
    }, {
      "city": "泉州",
      "areas": [{
        "name": "安溪营业厅",
        "location": "	安溪县凤城镇河滨南路168号龙湖山庄综合楼四楼-甲",
        "phone": "暂无"
      }, {
        "name": "溪美营业厅",
        "location": "	环城西路中骏蓝港湾上城小区3栋33-35号店面",
        "phone": "暂无"
      }, {
        "name": "水头镇营业厅",
        "location": "	南安市水头镇建材大道世纪新城2栋59号店面",
        "phone": "暂无"
      }, {
        "name": "磁灶营业厅",
        "location": "	磁灶镇政府一楼大厅正对大门",
        "phone": "暂无"
      }, {
        "name": "桥南营业厅		",
        "location": "兴贤路江夏丽景小区1栋6号店面（明发大酒店斜对面）",
        "phone": "暂无"
      }, {
        "name": "青阳营业厅",
        "location": "	晋江市青阳迎宾路华泉大厦",
        "phone": "暂无"
      }, {
        "name": "泉州客户体验中心",
        "location": "	丰泽区津淮街东段25号泉州燃气客户体验中心",
        "phone": "暂无"
      }, {
        "name": "石狮金林路营业厅		",
        "location": "	八七路1939-1941号店面",
        "phone": "暂无"
      }, {
        "name": "台商营业厅",
        "location": "	泉州台商投资区新杏秀路三鑫花园2-3号楼3号店面",
        "phone": "暂无"
      }, {
        "name": "惠安营业厅	",
        "location": "	世纪大道世纪大厦7-8号店",
        "phone": "暂无"
      }, {
        "name": "泉港营业厅	",
        "location": "	全港区南山中路投总大厦7楼",
        "phone": "暂无"

      }]
    }, {
      "city": "株洲",
      "areas": [{
        "name": "中心营业厅",
        "location": "	天元区沿江南路蓝盾景园门面",
        "phone": "暂无"
      }, {
        "name": "株百中心广场网点	",
        "location": "中心广场株洲百货大楼六楼",
        "phone": "暂无"
      }, {
        "name": "渌口营业厅",
        "location": "株洲县黎韶路（金声饭店对面）",
        "phone": "暂无"
      }, {
        "name": "株百天元超市网点",
        "location": "天元区长江广场天元超市4楼",
        "phone": "暂无"
      }, {
        "name": "株百红旗广场网点",
        "location": "荷塘区红旗广场东百货2楼",
        "phone": "暂无"
      }]
    }, {
      "city": "青岛",
      "areas": [{
        "name": "中心营业厅	",
        "location": "珠江路与武夷山路交界，千禧龙商业网点西端“青岛新奥燃气客户体验中心”",
        "phone": "暂无"
      }, {
        "name": "灵山卫营业厅	",
        "location": "灵山卫街道办事处珠山文苑社区",
        "phone": "暂无"
      }]
    }, {
      "city": "长沙",
      "areas": [{
        "name": "伍家岭营业厅	",
        "location": "新河路332号",
        "phone": "84471066"
      }, {
        "name": "新民路营业厅	",
        "location": "新民路102号",
        "phone": "88883482"
      }, {
        "name": "时代阳光大道营业厅	",
        "location": "时代阳光大道99号富景园综合楼1楼",
        "phone": "84206588"
      }, {
        "name": "星沙营业厅	",
        "location": "漓湘路6号",
        "phone": "84018110"
      }]
    }, {
      "city": "东莞",
      "areas": [{
        "name": "东城营业厅	",
        "location": "东城区东昇路朝阳苑小区一层101号铺",
        "phone": "88999077"
      }, {
        "name": "南城营业厅	",
        "location": "南城区胜和路金盈大厦一层12-14号铺",
        "phone": "88996098"
      }, {
        "name": "万江营业厅	",
        "location": "万江区金鳌路理想0769小区二期C9栋13号铺	",
        "phone": "88058108"
      }, {
        "name": "凤岗营业厅	",
        "location": "	风岗镇龙福花园地铺16号	",
        "phone": "82163311"
      }, {
        "name": "虎门营业厅	",
        "location": "		虎门镇连升北路775号煤气大厦1楼		",
        "phone": "85102140"
      }, {
        "name": "道滘营业厅	",
        "location": "	道滘镇花园大街2号银禧大厦9号铺	",
        "phone": "		81315019"
      }, {
        "name": "中堂营业厅	",
        "location": "		中堂镇振兴路45号国土资源局斜对面		",
        "phone": "88121639"
      }, {
        "name": "长安营业厅	",
        "location": "长安镇西安路17号	",
        "phone": "89992666"
      }, {
        "name": "高埗营业厅	",
        "location": "	高埗镇颐龙路新世纪颐龙湾2期10号商业楼106号",
        "phone": "81305588"
      }, {
        "name": "寮步营业厅	",
        "location": "寮步镇鸿图广场E4 - 5号",
        "phone": "83266677"
      }, {
        "name": "石碣营业厅	",
        "location": "石碣镇彩虹西路盈彩网吧对面",
        "phone": "83072088"
      }, {
        "name": "石龙营业厅	",
        "location": "石龙镇新城区裕兴路R4之三		",
        "phone": "81867968"
      }, {
        "name": "石排营业厅	",
        "location": "	石排镇崇威酒店6号铺位",
        "phone": "81397533"
      }, {
        "name": "莞樟营业厅	",
        "location": "	樟木头镇东城区银河北路建设大厦",
        "phone": "87708355"
      }, {
        "name": "黄江营业厅	",
        "location": "	黄江镇鸡啼岗村宝灵三街2号	",
        "phone": "82309898"
      }, {
        "name": "大岭山营业厅	",
        "location": "大龄山镇上场路35号",
        "phone": "88960388"
      }, {
        "name": "塘厦营业厅",
        "location": "	塘厦镇润塘东街兴怡居7栋112号商铺",
        "phone": "81397533"
      }, {
        "name": "厚街营业厅	",
        "location": "厚街镇厚街大道东39号盈丰大厦一楼104号",
        "phone": "89989000"
      }, {
        "name": "企石营业厅	",
        "location": "企石镇湖滨路1号华通城大酒店一楼商铺",
        "phone": "39027096"
      }, {
        "name": "东坑营业厅	",
        "location": "东坑镇骏发一路（快捷驾校对面）",
        "phone": "81186777"
      }, {
        "name": "沙田营业厅	沙田镇沿河路16号	86095966",
        "location": "塘厦镇润塘东街兴怡居7栋112号商铺",
        "phone": "81397533"
      }, {
        "name": "谢岗营业厅	",
        "location": "谢岗镇花园大道57号铺	",
        "phone": "82335318"
      }, {
        "name": "茶山营业厅	",
        "location": "茶山镇新世纪丽江豪园北门b14商铺	",
        "phone": "86487922"
      }, {
        "name": "洪梅营业厅	",
        "location": "红梅镇红梅文化商业中心A栋8号",
        "phone": "88844826"
      }, {
        "name": "麻涌营业厅		",
        "location": "麻涌镇麻涌大道公务员宿舍9号商铺",
        "phone": "88282964"
      }, {
        "name": "清溪营业厅	",
        "location": "	清溪镇三星村科技路汇酒店地铺6号",
        "phone": "87293899"
      }, {
        "name": "松山湖办事窗口	",
        "location": "松山湖管委会对面一站式服务大厅一楼",
        "phone": "23079266"
      }]
    }]
  },
  onChange(event) {
    const {
      key
    } = event.currentTarget.dataset;
    this.setData({
      [key]: event.detail
    });
  },
  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function() {

  }
})